Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the four truths of the noble ones, the eight aspects of liberation, and the nine serial steps of meditative absorption should train in the perfection of wisdom.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the ten powers of the tathāgatas should train in the perfection of wisdom.

source: །མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to perfect the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas should train in the perfection of wisdom. “

source: །བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ལ་གནས་ཏེ།
en: Bodhisattva great beings who dwell in the meditative stability associated with the branches of enlightenment and who wish to enter into absorption should train in the perfection of wisdom.

source: བསམ་གཏན་དང་པོ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས། བསམ་གཏན་གཉིས་པ་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: That is to say, arising from the first meditative concentration, they become absorbed in cessation, and on arising from that, they become absorbed in the second meditative concentration.

source: དེ་ལས་ལངས་ནས་བསམ་གཏན་གསུམ་པ་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the third meditative concentration.

source: དེ་ལས་ལངས་ནས་བསམ་གཏན་བཞི་པ་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the fourth meditative concentration.

source: དེ་ལས་ལངས་ནས་བྱམས་པའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the meditative stability of loving kindness.

source: དེ་ལས་ལངས་ནས་སྙིང་རྗེའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the meditative stability of compassion.

source: དེ་ལས་ལངས་ནས་དགའ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the meditative stability of empathetic joy.

source: དེ་ལས་ལངས་ནས་བཏང་སྙོམས་ཀྱི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the meditative stability of equanimity.

source: དེ་ལས་ལངས་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the sphere of infinite space.

source: དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་། དེ་ལས་ལངས་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the sphere of infinite consciousness.

source: དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the sphere of nothing-at-all.

source: དེ་ལས་ལངས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་མཉམ་པར་གཞག་པར་འཚལ་བ་དང་།
en: Arising from that, they become absorbed in cessation, and on arising from that, they become absorbed in the sphere of neither perception nor nonperception; and on arising from that they become absorbed in cessation.

source: དེ་ལས་ལངས་ནས་འགོག་པ་ལ་མཉམ་པར་གཞག་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ། །སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to be absorbed in the meditative stability named yawning lion should train in the perfection of wisdom.

source: །སེང་གེ་རྣམ་པར་རྩེ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to be absorbed in the meditative stability named lion’s play should train in the perfection of wisdom.

source: །གཟུངས་ཀྱི་སྒོ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཐོབ་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Bodhisattva great beings who wish to attain all the dhāraṇī gateways and all the gateways of meditative stability should train in the perfection of wisdom.

source: །དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ། །རིན་ཆེན་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་དང་། ཟླ་བའི་འོད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། ཟླ་བའི་རྒྱལ་མཚན་དཔལ་གྱི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱར་གྱུར་པའི་ཏིང་ངེ་འཛིན་དང་།
en: Bodhisattva great beings who wish to be absorbed in the meditative stability named heroic valor should train in the perfection of wisdom.

source: སྤྱན་རས་གཟིགས་ཀྱི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་དང་།
en: Bodhisattva great beings who wish to be absorbed in the meditative stability named precious seal should train in the perfection of wisdom.

source: ཆོས་ཐམས་ཅད་ཀྱི་དབྱིངས་སུ་ངེས་པའི་ཏིང་ངེ་འཛིན་དང་། ངེས་པའི་རྒྱལ་མཚན་དཔལ་གྱི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ལ་འཇུག་པའི་སྒོའི་ཏིང་ངེ་འཛིན་དང་། ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་ཏིང་ངེ་འཛིན་དང་། རྒྱལ་པོའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་དང་། དཔུང་རྣམ་པར་བཀོད་པའི་ཏིང་ངེ་འཛིན་དང་། ཡང་དག་པར་འཕགས་པའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ངེས་པའི་ཚིག་གདོན་མི་ཟ་བར་འཇུག་པའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཤེས་པར་གནས་པ་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་དང་། ཕྱོགས་བཅུར་རྣམ་པར་ལྟ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བའི་རང་བཞིན་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའི་གནས་ལ་གནས་པའི་ཏིང་ངེ་འཛིན་དང་། འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཏིང་ངེ་འཛིན་དང་། མངོན་པར་ཤེས་པ་མི་ཉམས་པའི་ཏིང་ངེ་འཛིན་དང་། སྣོད་དུ་གྱུར་པའི་ཏིང་ངེ་འཛིན་དང་། རྒྱལ་མཚན་རྩེ་མོའི་དཔུང་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་མ་ལུས་པར་སྲེག་པའི་ཏིང་ངེ་འཛིན་དང་། བདུད་བཞིའི་དཔུང་སེལ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: Bodhisattva great beings who wish to be absorbed in the meditative stability named moonlight, the meditative stability named crest of the moon’s victory banner, the meditative stability named sealing of all phenomena, {Dt.118} the meditative stability named sealing of Avalokita, the meditative stability named certainty of all phenomena in the realm of phenomena, the meditative stability named crest of certainty’s victory banner, the meditative stability named vajra-like, the meditative stability named gateway entering into all phenomena, the meditative stability named king of meditative stabilities, the meditative stability named seal of the king, the meditative stability named array of power, the meditative stability named sublimation [of all phenomena], the meditative stability named engaging with certainty in lexical explanations with respect to all phenomena, the meditative stability named entry into knowledge of all phenomena, the meditative stability named observation of the ten directions, the meditative stability named seal of the gateway of all dhāraṇīs, the meditative stability named unimpaired by all phenomena, the meditative stability named natural seal absorbing all phenomena, the meditative stability named abiding in space, the meditative stability named purity of the three spheres, the meditative stability named unimpaired extrasensory power, the meditative stability named worthy repository, the meditative stability named shoulder ornament of the victory banner’s crest, the meditative stability named incineration of all afflictions, the meditative stability named dispelling of the army of the four māras, the meditative stability named lamp of wisdom, the meditative stability named sublimation through the strength of the ten powers, and the meditative stability named unattached, liberated, and uncovered like space should train in perfection of wisdom.

source: ཡེ་ཤེས་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་དང་། སྟོབས་བཅུའི་སྟོབས་ཀྱིས་འཕགས་པའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པའི་རྣམ་པར་གྲོལ་བ་གོས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ། །དེ་ལྟར་དེ་དག་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་གཞན་དག་ཐོབ་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: So it is that bodhisattva great beings who wish to attain these [meditative stabilities] and the other gateways of meditative stability should train in the perfection of wisdom. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Moreover, Blessed Lord, bodhisattva great beings who wish to fulfill the aspirations of all beings should train in the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་དགེ་བའི་རྩ་བ་གང་ཡོངས་སུ་རྫོགས་པས་ངན་སོང་རྣམས་སུ་མི་ལྟུང་ཞིང་། རིགས་དམའ་བར་མི་སྐྱེ་བ་དང་། ཉན་ཐོས་ཀྱིས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་མི་གནས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་ཆེན་པོར་མི་ལྟུང་བ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ།
en: Furthermore, Blessed Lord, bodhisattva great beings who wish to fulfill the roots of virtue so that—because they will have perfected the roots of virtue—they do not regress to the three lower realms, are not born in inferior families, {Dt.119} do not regress to the level of the śrāvakas or the level of the pratyekabuddhas, or succumb to the great immaturity that bodhisattvas might have, should train in the perfection of wisdom.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱོན་ཆེན་པོར་ལྟུང་བ་ཡིན། དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, how do bodhisattva great beings succumb to great immaturity?”

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མི་མཁས་པས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ཅིང་། ཐབས་མི་མཁས་པས། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་བརྟེན་ཏེ། ཉན་ཐོས་དང་།
en: The venerable Subhūti replied, “Venerable Śāradvatīputra, when bodhisattva great beings who lack skill in means practice the six perfections, in doing so by basing themselves with a lack of skill in means on the meditative stabilities of emptiness, signlessness, and wishlessness, they do not regress to the level of śrāvakas and pratyekabuddhas, but nor do they enter a bodhisattva’s full maturity.

source: རང་སངས་རྒྱས་ཀྱི་སར་ཡང་མི་ལྟུང་ལ།
en: That is the immaturity of bodhisattva great beings.” “

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཡང་མི་འཇུག་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་ནོ། །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན་དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་དུ་འགྱུར།
en: Venerable Subhūti, why is that the immaturity of bodhisattva great beings?”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་ཞེས་བྱ་བ་ནི། འདི་ལྟ་སྟེ། ཆོས་ལ་སྲེད་པའོ།
en: Subhūti replied, “Venerable Śāradvatīputra, that ‘immaturity’ of bodhisattva great beings is a craving for the Dharma.” “

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་ལ་སྲེད་པ་གང་ཡིན།
en: Venerable Subhūti,” he asked, “what is craving for the Dharma?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་སྟོང་ཞེས་བྱ་བར་མངོན་པར་ཆགས་ཤིང་གནས་ཏེ་འདུ་ཤེས་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: Venerable Śāradvatīputra,” replied Subhūti, “when bodhisattva great beings practice the perfection of wisdom, they become attached to and fixated on the notion that physical forms are empty, and similarly, they become attached to and fixated on the notion that feelings, perceptions, formative predispositions, and consciousness are empty.

source: འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བར་མངོན་པར་ཆགས་ཤིང་གནས་ཏེ་འདུ་ཤེས་པ་འདི་ནི། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཐུན་པའི་ཆོས་ལ་སྲེད་པ་སྟེ། སྐྱོན་དུ་འགྱུར་བའོ།
en: Venerable Śāradvatīputra, these notions are the craving for the Dharma, indicative of the immaturity of bodhisattva great beings. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་མི་རྟག་ཅེས་བྱ་བར་མངོན་པར་ཆགས་ཤིང་གནས་ཏེ་འདུ་ཤེས་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་མངོན་པར་ཆགས་ཤིང་གནས་ཏེ་འདུ་ཤེས་པ་དང་། གཟུགས་སྡུག་བསྔལ་བའོ་ཞེས་བྱ་བ་དང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings become attached to and fixated on the notion that physical forms are impermanent, and they become attached to and fixated on the notion that feelings, perceptions, formative predispositions, and consciousness are impermanent.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་བའོ་ཞེས་བྱ་བ་དང་། གཟུགས་བདག་མེད་ཅེས་བྱ་བ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བདག་མེད་ཅེས་བྱ་བ་དང་། གཟུགས་ཞི་ཞེས་བྱ་བ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞི་ཞེས་བྱ་བ་དང་། གཟུགས་སྟོང་ཞེས་བྱ་བ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བ་དང་། གཟུགས་མཚན་མ་མེད་ཅེས་བྱ་བ་དང་།
en: They become attached to and fixated on the notion that physical forms are imbued with suffering; the notion that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering; the notion that physical forms are not a self; the notion that feelings, perceptions, formative predispositions, and consciousness are not a self; the notion that physical forms are at peace; the notion that feelings, perceptions, formative predispositions, and consciousness are at peace; the notion that physical forms are empty; the notion that feelings, perceptions, formative predispositions, and consciousness are empty; the notion that physical forms are without signs; the notion that feelings, perceptions, formative predispositions, and consciousness are without signs; and the notion that physical forms are without aspirations.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། གཟུགས་སྨོན་པ་མེད་ཅེས་བྱ་བར་མངོན་པར་ཆགས་ཤིང་གནས་ཏེ་འདུ་ཤེས་པ་དང་།
en: They become attached to and fixated on the notion that feelings, perceptions, formative predispositions, and consciousness are without aspirations.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་མེད་ཅེས་བྱ་བར་མངོན་པར་ཆགས་ཤིང་གནས་ཏེ་འདུ་ཤེས་པ་འདི་ནི། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཐུན་པའི་ཆོས་ལ་སྲེད་པ་སྟེ། སྐྱོན་དུ་འགྱུར་བའོ། །གཟུགས་འདི་སྤང་བར་བྱའོ། །འདིས་གཟུགས་སྤང་བར་བྱའོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འདི་སྤང་བར་བྱའོ། །འདིས་རྣམ་པར་ཤེས་པ་སྤང་བར་བྱའོ། །སྡུག་བསྔལ་འདི་ཡོངས་སུ་ཤེས་པར་བྱའོ། །འདིས་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་བྱའོ། །ཀུན་འབྱུང་བ་འདི་སྤང་བར་བྱའོ། །འདིས་ཀུན་འབྱུང་བ་སྤང་བར་བྱའོ། །འགོག་པ་འདི་མངོན་དུ་བྱའོ། །འདིས་འགོག་པ་མངོན་དུ་བྱའོ། །ལམ་འདི་བསྒོམ་པར་བྱའོ། །འདིས་ལམ་བསྒོམ་པར་བྱའོ། །འདི་ནི་ཀུན་ནས་ཉོན་མོངས་པའོ། །འདི་ནི་རྣམ་པར་བྱང་བའོ། །ཆོས་འདི་དག་ནི་བསྟེན་པར་བྱ་བའོ། །ཆོས་འདི་དག་ནི་བསྟེན་པར་མི་བྱ་བའོ། །འདི་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྤྱད་པར་བྱའོ། །འདི་ལ་ནི་སྤྱད་པར་མི་བྱའོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་མོ། །འདི་ནི་ལམ་མ་ཡིན་ནོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའོ། །འདི་ནི་བསླབ་པ་མ་ཡིན་ནོ།
en: These notions, Venerable Śāradvatīputra, are the craving for the Dharma indicative of the immaturity of bodhisattva great beings. “

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ། །འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ། །འདི་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །འདི་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ། །འདི་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །འདི་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ། །འདི་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །འདི་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: They become attached to and fixated on the notions that these physical forms are to be renounced, and that they should renounce physical forms; {Dt.120} that these feelings, perceptions, formative predispositions, and consciousness are to be renounced, and that they should renounce consciousness [and the other aggregates]; that this suffering should be comprehended, and that they should comprehend suffering; that this cause of suffering should be renounced, and that they should renounce the cause of suffering; that this cessation [of suffering] should be actualized, and that they should actualize the cessation [of suffering]; that this path should be cultivated, and that they should cultivate the path; that this is affliction and that is purification; that these attributes should be tended and those attributes should not be tended; that bodhisattva great beings should do this and they should not do that; that this is the path of the bodhisattvas and that is not the path; that this is the training of the bodhisattvas and that is not the training; that this is the bodhisattvas’ perfection of generosity, and that is not the perfection of generosity; that this is the bodhisattvas’ perfection of ethical discipline, and that is not the perfection of ethical discipline; that this is the bodhisattvas’ perfection of tolerance, and that is not the perfection of tolerance; that this is the bodhisattvas’ perfection of perseverance, and that is not the perfection of perseverance; that this is the bodhisattvas’ perfection of meditative concentration, and that is not the perfection of meditative concentration; that this is the bodhisattvas’ perfection of wisdom, and that is not the perfection of wisdom; that this is the bodhisattvas’ skill in means, and that is not skill in means; and that this is the maturity of the bodhisattvas, and that is their immaturity.

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ནོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་མཁས་པའོ། །འདི་ནི་ཐབས་མཁས་པ་མ་ཡིན་ནོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པའོ། །འདི་ནི་སྐྱོན་དུ་འགྱུར་བའོ། །ཞེས་བྱ་བར་ཆོས་དེ་དག་ལ་མངོན་པར་ཆགས་ཤིང་གནས་ཏེ་འདུ་ཤེས་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཐུན་པའི་ཆོས་ལ་སྲེད་པ་སྟེ།
en: These notions are the craving for the Dharma indicative of the immaturity of bodhisattva great beings.” “

source: སྐྱོན་དུ་འགྱུར་བའོ། །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་གང་ཡིན། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནང་སྟོང་པ་ཉིད་ལ་ཕྱི་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཕྱི་སྟོང་པ་ཉིད་ལ་ནང་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཕྱི་སྟོང་པ་ཉིད་ལ་ཕྱི་ནང་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་ཕྱི་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ལ་ཕྱི་ནང་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ལ་ཆེན་པོ་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཆེན་པོ་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཆེན་པོ་སྟོང་པ་ཉིད་ལ་དོན་དམ་པ་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། དོན་དམ་པ་སྟོང་པ་ཉིད་ལ་ཆེན་པོ་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། དོན་དམ་པ་སྟོང་པ་ཉིད་ལ་འདུས་བྱས་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: Venerable Subhūti, what is the maturity of a bodhisattva great being?” “
